app/views/search/index.html.erb

  <% SearchController.new.add_to_database(params[:search_text]) %>
  <% @products = Product.paginate(:page => params[:page], :per_page => 10) %>
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"