app/controllers/search_controller.rb

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
INSERT INTO "products" ("title", "description", "price", "link", "img_src", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def add_to_database search_text
    Product.destroy_all
    products_info = get_all_products(search_text)
    (0...products_info[0].length).each do |i|
      Product.create(title: products_info[0][i], price: products_info[1][i], link: products_info[2][i])